{"newspapers": {"foxnews": {"link": "http://www.foxnews.com/", "articles": [{"published": "2017-06-24T00:00:00", "title": "Ex-doctor charged in pill mill scheme dies after being shot", "text": "A former Ohio doctor awaiting sentencing on charges related to operating an opioid \"pill mill\" has died after being fatally shot during an apparent home invasion.\n\nFifty-one-year-old Kevin Lake died Friday night at a hospital after being shot Thursday morning in the Columbus suburb of Westerville.\n\nThe Franklin County Sheriff's Office said Lake's son called 911 and reported hearing gunshots after someone tried to break into the home. Major Steve Tucker said the family had recently received a written threat.\n\nLake pleaded guilty to federal charges in January for evading $3.5 million in taxes and for prescribing oxycodone, hydrocodone and Xanax to hundreds of patients daily at a Columbus medical clinic.\n\nHe resigned as an Ohio University trustee on Jan. 21.", "link": "http://www.foxnews.com/us/2017/06/24/ex-doctor-charged-in-pill-mill-scheme-dies-after-being-shot.html"}, {"published": "2017-06-24T00:00:00", "title": "Over 120 people buried by massive southwest China landslide", "text": "More than 120 people were buried by a landslide that caused huge rocks and a mass of earth to come crashing into their homes in a mountain village in southwestern China early Saturday, officials said.\n\nThe landslide, which came from a mountain, engulfed a cluster of 62 homes and a hotel in the village of Xinmo in Mao County at about 6 a.m., the Sichuan provincial government said. Officials said 1 mile of road were buried in the disaster.\n\n\"It's the biggest landslide to hit this area since the Wenchuan earthquake,\" Wang Yongbo, an official leading one of the rescue efforts, told state broadcaster China Central Television. Wang was referring to China's deadliest earthquake this century, a magnitude 7.9 temblor that struck Sichuan province in May 2008, killing nearly 90,000 people.\n\nThe provincial government said more than 120 people were buried by the landslide. CCTV cited a rescuer as saying five bodies had been found.\n\nRescuers pulled out three people, two of whom had survived, the official Sichuan Daily newspaper said on its microblog. The paper also said a family of three, including a month-old baby, managed to escape just as the landslide started to hit their house.\n\nRelated Image Expand / Collapse\n\nQiao Dashuai told CCTV that the baby saved the family because he was woken up by the child's crying and was going to change the baby's diaper when he heard a noise that alerted him to the landslide.\n\n\"We heard a strange noise at the back of our house, and it was rather loud,\" Qiao said. \"Wind was coming into the room so I wanted to close the door. When we came out, water flow swept us away instantly.\" He said they struggled against the flood of water until they met medical workers who took them to a hospital. Qiao said his parents and other relatives had not been found.\n\nMao County, or Maoxian, sits on the eastern margin of the Tibetan plateau and is home to about 110,000 people, according to the government's website. Most residents are of the Qiang ethnic minority. The village is known locally for tourism, and Chinese reports said it was unclear if tourists were among those buried by the landslide.\n\nThe landslide blocked a 1.2-mile section of a river. The provincial government said on its website that an estimated 282 million cubic feet of earth and rock — equivalent to more than 3,000 Olympic-sized swimming pools — had slid down the mountain.\n\nExperts told CCTV that the landslide was likely triggered by rain. A meteorologist interviewed by CCTV said there was light rain in the area that would continue for a few days.\n\nRelated Image Expand / Collapse\n\nThe Sichuan Daily said rescuers made contact with a villager buried under the rubble who answered her cellphone when they called and burst into tears. The woman was in the bedroom of her home when the landslide hit the village, and rescuers were trying to reach her, the report said.\n\nSearch and rescue efforts were underway involving more than 400 workers, including police. CCTV showed footage of rescuers in bright orange uniforms using earth movers and excavators but also relying on ropes to pull at huge rocks and shovels to dig up the dirt.\n\nProvincial police sent 500 rescuers with two dozen sniffer dogs to the site, the official Xinhua News Agency reported.", "link": "http://www.foxnews.com/world/2017/06/24/over-120-people-buried-by-massive-southwest-china-landslide.html"}, {"published": "2017-06-23T00:00:00", "title": "'Too Much Misinformation': Trump Supporter Splits With ABC News Over Trump Coverage", "text": "", "link": "http://insider.foxnews.com/2017/06/23/abc-trump-russia-billboard-slam-coverage"}, {"published": "2017-06-11T00:00:00", "title": "UFO hunters spot 'weird orb' while lost in hills near Boston", "text": "Three UFO hunters snapped a photo of a mysterious object while they were lost in the Blue Hills near Boston last week, according to reports.\n\nRamona DiFrancesco and her friends were lost for several hours Thursday night and had to be rescued by state police, WHDH-TV reported.\n\nDiFrancesco, 18, of Plymouth, told the station she and her friends spotted UFOs they had never seen before Thursday night.\n\n“Well, we saw these two ships that had these like bright spotlights and then we saw this like weird orb that was like a spotlight, sort of,” she told the station.\n\nShe showed a WHDH reporter a photo of the mysterious object she said had been taken with a Nikon camera.\n\nThey got lost on Buck Hill, The Boston Globe reported.\n\n“Our phones were dying,” the paper quoted DiFrancesco as saying. “We didn’t have any flashlights. We were a little unprepared.\"\n\nA state police helicopter spotted them and officers led them down a trail on foot.\n\nThey were not hurt.", "link": "http://www.foxnews.com/science/2017/06/11/ufo-hunters-spot-weird-orb-while-lost-in-hills-near-boston.html"}]}, "theguardian": {"rss": "https://www.theguardian.com/uk/rss", "link": "https://www.theguardian.com/international", "articles": [{"title": "Ministers in abrupt U-turn over fire safety in schools", "published": "2017-06-24T20:30:08", "link": "https://www.theguardian.com/uk-news/2017/jun/24/government-u-turn-over-fire-safety-controls-for-new-schools", "text": "Government goes back to drawing board after deciding that cost-cutting rules ‘would have been a disaster’ in light of Grenfell Tower disaster\n\nControversial government proposals to relax fire safety standards for new school buildings as a cost-cutting measure are to be dropped by ministers in a major policy U-turn following the Grenfell Tower fire.\n\nThe move is evidence of a dramatic change of approach across government, from a previous preoccupation with deregulation and cost-saving to a safety-first attitude, in the aftermath of the west London tower block tragedy.\n\nAfter thousands of people were evacuated amid chaotic scenes from five tower blocks in Camden, London, late on Friday night, Theresa May said the priorities were to find temporary accommodation for those affected and make the buildings safe before people could return.\n\nBut the crisis appeared to be spreading yesterday with the announcement that a total of 27 blocks in 15 council areas in England had been deemed unsafe. Several councils have begun work on removing cladding from the tower blocks, but there was disquiet among some local authority leaders that the government would push the cost of emergency works, such as sprinkler systems, on to councils.\n\nJeremy Corbyn described the cladding issue as “a nationwide threat” and said the prime minister needed to “get a grip and lead a national response”.\n\n“I urge the government to make sure all necessary support – including, crucially, financial support – is urgently made available to councils across the country,” he said.\n\nThe prime minister said the government was working with councils, including Camden, “making sure that the resources are there to ensure that what is needed to keep people safe is done”.\n\nAcross government, ministers have been ordered to look again at fire safety policies in their departments. An urgent rethink has been under way at the Department for Education, which had begun a consultation on official new draft guidance on fire safety in schools last year that was widely seen as a substantial watering down of safety requirements.\n\nFire safety experts, backed by senior MPs, expressed deep alarm over the past year at the plans and warned ministers repeatedly that they could have disastrous results.\n\nPart of the revised draft guidance – which the Observer has learned will now be dropped – removed the requirement that sprinklers be included in the design of new schools and stated, instead, that “school buildings do not need to be sprinkler protected to achieve a reasonable standard of life safety”. It also said it “no longer includes an expectation that most new school buildings will be fitted with them”.\n\nIn a letter to schools minister Nick Gibb last August, London fire commissioner Ron Dobson said such changes could have “potentially devastating consequences”. Gibb announced the consultation on changes in a parliamentary debate on fire safety the previous October. He said the number of fires in schools had declined and pointed out that “including sprinklers in new school buildings would add between 2% and 6% to the cost of works”.\n\nFacebook Twitter Pinterest Shadow education minister Angela Rayner said parents want to know that schools are safe for our children. Photograph: Linda Nylind for the Guardian\n\nGibb, one of the main forces behind the government’s academy and free schools programme, added: “The department’s assessment is that the additional spending would significantly outweigh any relatively modest saving from preventing some damage to school buildings.”\n\nIn the same debate, the Tory MP and chair of the all-party parliamentary group on fire safety, David Amess, said it was “crazy” that under the Tory government the proportion of new schools and academies fitted with sprinkler systems had already fallen from 70% (between 2007 and 2010, under Labour) to 35%. “That is unacceptable,” he said.\n\nWhen the draft guidelines were published, teaching unions and fire safety organisations protested again but formed the impression that ministers were not listening and that the consultation was a sham.\n\nLast week, in the aftermath of the Grenfell Tower fire, the revised draft guidance had been removed from the DfE website. Amid signs of panic, officials tried to insist that there had never been any intention to change policy.\n\nThe Observer now understands that the proposals in the new draft guidance are to be taken back to the drawing board and that any sections which might be seen as weakening safety requirements – including the new language suggesting sprinklers are unnecessary – will be struck out.\n\nA government source insisted: “What we would like to stress is that what we do will be a strengthening of fire safety requirements, not any weakening of them.” Asked if that meant a rethink on sprinklers in new schools, the source said: “That would be entirely fair.” A DfE spokesman said: “There will be no change to the fire safety laws for schools or our determination to protect children’s safety.”\n\nLast night, Amess said he would welcome a change of approach but added: “We will keep up the pressure until a policy that makes sprinklers mandatory in all new schools is announced. We will also insist that checks are carried out on all existing schools to make sure they are safe.”\n\nShadow education secretary Angela Rayner said: “Parents want to know that schools are safe for our children, and there are real questions for the government to answer. It would be completely unacceptable if they have attempted to water down safety requirements simply to make free schools cheaper or let developers make an easier profit.”\n\nThe aftermath of the Grenfell Tower fire continued to play out on Saturday as the government named six of 15 local authorities where tower blocks have failed safety tests.\n\nPortsmouth, Brent, Camden, Manchester, Plymouth and Hounslow had all sent samples of cladding for testing and were told on Friday that there was a risk they could catch fire.\n\nCamden decided on Friday night to evacuate about 650 households from the Chalcots estate in north London, but many were forced to spend the night in a local leisure centre, prompting anger and complaints from residents.\n\nNone of the other councils said yesterday that they would follow Camden’s lead, although Sajid Javid, the communities secretary, said it was a “correct decision”. “Public safety is absolutely paramount, you cannot put a price on people’s lives,” he said.\n\nMany councils have taken emergency measures, including posting 24-hour patrols to keep watch on the affected tower blocks.\n\nWith many local authorities, including Sheffield, installing sprinkler systems, there is growing unease among some council leaders that they will end up footing a large part of the bill.\n\nJavid said it was too early to say what the total cost would be. “If [local authorities] also have an issue with financial resources, we have made it very clear: you get on with that work, but you come to government and we will work with you make sure you have the resources that you need, if you don’t have resources.”\n\nNick Forbes, the leader of Newcastle Council, said this fell short of a guarantee. “Govt have just confirmed on @BBCBreakfast that, despite all their talk of help, councils will have to pay to install sprinklers in blocks,” he tweeted. He called on the government to lift a cap limiting the amount councils can borrow in relation to housing."}, {"title": "China landslide: at least 15 dead and more than 100 feared buried", "published": "2017-06-24T18:58:09", "link": "https://www.theguardian.com/world/2017/jun/24/china-landslide-sichuan-province-xinmo-people-feared-buried", "text": "Rescue operation is under way in Sichuan province after more than 40 homes in Xinmo village were engulfed by landslide\n\nAt least 15 people have been killed and about 100 are believed to be buried in the debris after a landslide in south-west China’s Sichuan province.\n\nChinese state media announced on Saturday that more than 60 homes had been covered in mud and rubble as dawn broke in Xinmo, a remote village in north Sichuan.\n\n\n\nThe debris slid 800 metres (half a mile) down a steep slope to block a 2km stretch of river and 1.6km of road, according to the official state news agency, Xinhua. More than 1,000 workers were involved in the rescue effort, including more than a hundred medical staff.\n\n\n\nXinhua, quoting rescue headquarters, said 15 bodies had been retrieved from the debris by Saturday night. More than 120 people were believed to have been buried, it said. Geological experts at the site said the chances of them surviving were slim, Xinhua said.\n\n\n\nThe state broadcaster, CCTV, reported that by midday local time only three people had been pulled alive from the rubble – a couple and their two-month-old baby. Another child from the same family remained buried.\n\n\n\nPhotos from the official People’s Daily showed rescue efforts, which involved more than 400 people, continuing after nightfall using torches. It said rescuers were trying to reach two people they believe they had heard trapped beneath the rubble.\n\n\n\nState television reports showed villagers and rescuers scrambling over mounds of mud and rocks that had slid down the mountainside. Water thick with mud flowed over the site, submerging a car pushed from the road, while police and residents pulled on ropes to try to dislodge large boulders.\n\n\n\nPolice have closed roads in the county to all traffic except emergency services, the news agency said.\n\n\n\nWang Yongbo, a local rescue official, told CCTV an estimated 3m cubic metres (105m cubic feet) of earth and rock had fallen.\n\nThere is an extensive network of dams in the area, which is close to the region of Tibet, including two hydropower plants in Diexi town near the buried village.\n\nHeavy rain caused the landslide, the provincial department of land and resources said, according to Xinhua.\n\n\n\nThe area is prone to earthquakes, including one in 1933 that resulted in parts of Diexi town becoming submerged by a nearby lake, and an 8.0 magnitude tremor in central Sichuan’s Wenchuan county in 2008 that killed nearly 70,000 people."}, {"title": "Glastonbury 2017: Saturday evening with Katy Perry, Solange and Foo Fighters – follow it live!", "published": "2017-06-24T20:59:55", "link": "https://www.theguardian.com/music/live/2017/jun/24/glastonbury-2017-saturday-evening-katy-perry-solange-and-foo-fighters-follow-it-live", "text": "Perry pop does its best to banish the grey skies, Stormzy and Solange up the tempo, and Foo Fighters come to do the headline set they should have done two years ago"}, {"title": "Trump CIA director blames 'worship of Edward Snowden' for rise in leaks", "published": "2017-06-24T19:53:48", "link": "https://www.theguardian.com/us-news/2017/jun/24/trump-cia-edward-snowden-leaks-state-secrets", "text": "Mike Pompeo said more needed to be done to stem what he called an increase in the leaking of state secrets to ‘undermine the United States and democracy’\n\nMike Pompeo, the director of the CIA, has blamed the “worship” of leakers such as Edward Snowden for a rise in the public disclosure of US intelligence.\n\n\n\nNew details of Russia election hacking raise questions about Obama's response Read more\n\nDonald Trump’s pick to head the intelligence agency said more needed to be done to stem what he called an increase in the leaking of state secrets.\n\n“In some ways, I do think [leaking has] accelerated,” Pompeo told MSNBC in an interview broadcast on Saturday. “I think there is a phenomenon, the worship of Edward Snowden, and those who steal American secrets for the purpose of self-aggrandizement or money or for whatever their motivation may be, does seem to be on the increase.”\n\nPompeo added: “It’s tough. You now have not only nation states trying to steal our stuff, but non-state, hostile intelligence services, well-funded – folks like WikiLeaks, out there trying to steal American secrets for the sole purpose of undermining the United States and democracy.”\n\nSnowden is a former CIA employee who in 2013 revealed the extent of surveillance programs of ordinary citizens by the National Security Agency, leaking documents to media outlets including the Guardian. Snowden, who now lives in Moscow, has been hailed by some as a whistleblower who exposed a system that intruded on people’s private lives to a degree that blunted genuine national security efforts.\n\nPompeo, along with many other Republicans and some Democrats, has taken a dimmer view of the revelations. Last year, he called for Congress to “pass a law re-establishing collection of all metadata”.\n\nIn a National Review op ed published in December 2015, he wrote: “To share Edward Snowden’s vision of America as the problem is to come down on the side of President Obama’s diminishing willingness to collect intelligence on jihadis.”\n\nWikiLeaks, meanwhile, has been a thorn in the side of the US government for some time. In 2010 Chelsea Manning, a former US army private who was recently released after being convicted by court marshal in 2013, gave Wikileaks more than 700,000 documents and diplomatic cables.\n\nIn March 2017, WikiLeaks revealed information on CIA activities, releasing nearly 8,000 documents that it said showed how the agency accesses computers. Speaking in April, Pompeo said: “It is time to call out WikiLeaks for what it really is – a non-state hostile intelligence service often abetted by state actors like Russia.”\n\n\n\nQatar blockade exposes rifts in Trump administration's 'peculiar' foreign policy Read more\n\nDuring the 2016 election, WikiLeaks published Democratic party emails procured in a hack US intelligence agencies including the CIA believe was carried out by Russian actors seeking to help the Trump campaign.\n\n\n\nLinks between Trump aides and Moscow are now the focus of FBI and congressional investigations. The Trump White House has made attacks on those who leak confidential information a central plank of its response to those investigations.\n\nIn his MSNBC interview on Saturday, Pompeo predicted the Trump administration will have success in deterring leakers “as well as punishing those who we catch who have done it”.\n\n\n\nThe CIA director said Trump was an “avid consumer” of intelligence material. “Our goal is that he has the facts, the truth,” he said.\n\nPompeo said that while Islamic State remains an “enormous” threat to the US, he considered Iran a greater menace. He also identified North Korea as a “very real danger” and said Trump asks him about the communist dictatorship almost every day."}]}, "breitbart": {"link": "http://www.breitbart.com/", "articles": [{"published": "2017-06-23T00:00:00", "title": "Dem Rep Who Joked About Kellyanne Conway on Her Knees: Sexism Plays Well in the South", "text": "Friday on MSNBC’s “Morning Joe,” Congressional Black Caucus chairman Rep. Cedric Richmond (D-LA), who once joked White House aide Kellyanne Conway “really looked kind of familiar” kneeling on an Oval Office couch, said sexism was an “effective” tactic in the South.\n\nadvertisement\n\nRichmond made that comment with regards to ads attacking Minority Leader Nancy Pelosi (D.-CA) in Georgia’s special election earlier this week.\n\nAfter a backlash, Richmond apologized for the sofa comments.\n\nDiscussing the Pelosi ads, Richmond said, “Well, I think that you use that in the South. I’m from the south. And I represent a district in Louisiana, and I think that there are a number of things you can do in the South that are easy — that doesn’t make it right. You can you always have subtle hints of racism or sexism and other things, and it will be effective to some extent, unfortunately. I don’t think it makes it right. I think it’s the reality we live in. We have to do a better job as Democrats of talking about what we believe in, what we stand for, and what our track record is.”\n\n“I think that you also can anticipate what people use against you and take it off the table very early,” he added. “So I think both races were incredibly difficult races to win. But we didn’t, and we wanted to, and we kind of expected to, so every loss hurts, and we have to figure out how to go back and win.”\n\n(h/t NTK)\n\nFollow Pam Key on Twitter @pamkeyNEN", "link": "http://www.breitbart.com/video/2017/06/23/dem-rep-joked-kellyanne-conway-knees-sexism-plays-well-south/#disqus_thread"}, {"published": "2017-06-23T00:00:00", "title": "Islamic State Poster Shows Car Crushing Skulls: ‘Run Over Them Without Mercy’", "text": "A pro-Islamic State media operation called the Nashir News Agency published a poster calling for more vehicular jihad in the last few days of the Ramadan holiday season, depicting an SUV driving across a mountain of skulls beneath the caption, “Run Over Them Without Mercy.”\n\nThe UK Daily Mail notes that ISIS claimed responsibility for the recent vehicle and knife attacks at Westminster Bridge and London Bridge, which definitely fit into the “run over them without mercy” template.\n\nadvertisement\n\nThe Drive more specifically describes the vehicle in the poster as a Jeep Grand Cherokee sporting a black Islamic State flag. It is also noteworthy that the city in the background of the poster is being devoured by tornadoes, which adds a characteristically apocalyptic touch to the ISIS propaganda, although it makes the helicopter hovering in the upper-left corner of the Photoshopped image a bit implausible.\n\nThis is not the first exhortation to vehicular jihad published by the Nashir News Agency, which exists mostly as a channel on the secure messaging platform Telegram. A few weeks ago, they published a message in both English and Arabic that said, “Kill the civilians of the Crusaders, run over them by vehicles, gain benefit from Ramadan.”\n\nThis earlier poster was a much less polished bit of propaganda, accompanied only by clip art of a handgun, knife, and truck. The pictures were helpfully labeled “Handgun,” “Knife,” and “Truck” for the benefit of less subtle jihadi minds.\n\nThe Daily Mail explains the increase in terrorist violence during Ramadan as follows:\n\nRamadan is a holy month of fasting in the Islamic calendar, in which good deeds are rewarded manifold, and bad deeds especially punished. In ISIS’s twisted interpretation of Islam, this means attacks on non-believers and apostates – which it considers ‘good’ – will be honored many times over in the afterlife.\n\nVoice of America News pondered the question of Ramadan violence at length in the early days of this year’s holiday and concluded that, while other terrorist groups also promote the idea of greater divine rewards for jihadi violence during the holy month, ISIS is exceptionally vigorous about driving the point home.\n\n“Your targeting of the so-called innocents and civilians is beloved by us and the most effective, so go forth and may you get a great reward or martyrdom in Ramadan. Attack them in their homes, their markets, their roads and their forums,” the Islamic State declared in one message titled “Where Are the Lions of War?”\n\nThe Taliban complained about “ignorance of religion” when the United Nations called for an end to hostilities during Ramadan, citing the very precise multiplier for virtue laid out in Islamic texts: “Our fight is jihad and an obligatory worship, and every obligatory act of worship has 70 times more reward in Ramadan.”\n\nSome of the analysts quoted by VOA offered other, more strategic explanations, such as the vulnerability of Muslim crowds in places like Baghdad to mass-casualty attacks as they gather for Ramadan celebrations, and the reduced effectiveness of security forces in Islamic nations due to holiday fasting.", "link": "http://www.breitbart.com/national-security/2017/06/23/islamic-state-video-shows-car-crushing-skulls-run-without-mercy/"}, {"published": "2017-06-22T00:00:00", "title": "Hands-On with ‘Assassin’s Creed Origins’ at E3: Ubisoft’s Adventure in Ancient Egypt Feels Like a Step Backwards", "text": "After taking a year to reorient a franchise on the verge of exhaustion, Ubisoft dons the iconic hood once more with Assassin’s Creed Origins.\n\nadvertisement\n\nI am genuinely unsure of whether the year’s respite has been good for the Assassin’s Creed franchise. Given time with a playable slice at this year’s E3, I was struck by two things. First, that the franchise felt largely unchanged in ways I had hoped to see it evolve. Second, the ways Origins has changed have pushed it toward the sort of Ubisoft open-world homogenization that has been creeping into all of their major franchises.\n\nThe setting for Origins, at least, is unique. Ancient Egypt isn’t exactly well-worn territory for video games, and it’s rendered in vivid, authentic detail here. Not since Ezio’s Italy campaing has the world felt so distinct, its sense of adventure so immediate. If the franchise’s sabbatical has provided anything, it’s that it has been time for Ubisoft’s artists to develop a truly transportive sense of environment. Much of this is due to the NPCs on display, both human and animal. They move and behave with more life than we’ve ever seen from the urban sprawl in any previous setting, due primarily to the fact that they have been gifted with substantive artificial intelligence for the first time.\n\nRather than animated mannequins, the denizens of Assassin’s Creed Origins’ Egypt have their own routines, priorities, and interactions. It makes little difference to anyone running breakneck through the world, but for the determined explorer — and I am most certainly one — it breathes life into otherwise thoughtless navigation. We weren’t able to see very much of that in our time-restricted demo, and many of the more interesting interactions on display smelled of pre-scripted events, but the possibilities give me hope for the wider game world.\n\nUnfortunately, the classic Assassin’s Creed fantasy seems to have been thrown aside in favor — of all things — crafting. That Ubisoft gameplay time-sink staple from other series has been brought from afterthought to center stage to support the more RPG-like loot aspects of Origins. And while the prospect of a custom loadout seems like it would be a great fit for a game about building the perfect assassin, in practice, it looks a lot like more like Far Cry‘s oft-derided exercise in animal looting.\n\nSimilarly, a drone-equivalent hawk companion has been cribbed from Watch Dogs, complete with a UI that looks more like it was pulled from Transformers than the Nile. It’s crucial to the same enemy marking system that we’ve seen in both of the aforementioned franchises. Here, social media information has been replaced with levels and behaviors of NPCs. The information accomplishes two things: it robs the conflicts of any shred of remaining immersion, as floating health bars and level numbers above your foes; and it lets you know when you’ve gotten in over your head.\n\nThat’s because your skill in Assassin’s Creed Origins matters much less than your progression. Your deadly grace through gameplay comes in a distant second to your relative level, and even the most mundane guardsman will handily end your life if his world area is leveled higher than you’ve managed. Even driving a hidden blade through the skull of an unsuspecting target will result in little more than annoyance if you haven’t gained enough experience and looted enough hippo hides to make sure your assassin’s blade is… what? Extra sharp?\n\nThe Assassin’s Creed series has always done at least one thing right. It makes you feel as if you are a dangerous assassin, with a dozen ways to dispatch horrible deaths at the tips of your fingers. You have always been a hooded revenant, a mysterious entity of both light and dark. Lethality is at the heart of the experience. It is mystifying to me that such an essential piece of the series’ power has been so readily muted.\n\nIt isn’t difficult to understand what Assassin’s Creed Origins is trying to do; a massive world filled with errands to run and items to collect makes for games with impressive duration. But if the newly revamped AI and mission design doesn’t do a lot of the heavy lifting, our journey across the sands will be an exercise in painful monotony — and a far cry from the revitalization that Ubisoft is hoping to achieve for the series.\n\nFollow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.", "link": "http://www.breitbart.com/tech/2017/06/22/hands-on-with-assassins-creed-origins-at-e3-ubisofts-adventure-in-ancient-egypt-feels-like-a-step-backwards/"}, {"published": "2017-06-23T00:00:00", "title": "Ann Coulter: GOP Health Care Bill a ‘Total Disaster,’ ‘Obamacare Lite’", "text": "Friday on Fox Business Network’s “Varney & Company,” conservative columnist Ann Coulter said the Senate Republicans’ health care bill was a “total disaster” because it is “Obamacare-lite.”\n\nadvertisement\n\nCoulter called for a “one-sentence law saying there shall be a free market in health insurance.”\n\n“[U]nder the Republicans’ health care bill, guess who’s still paying for transgender operations? Guess who still can’t go to Memorial Sloan Kettering? Guess who will still be paying 700 dollars a month for heath insurance? No, I don’t want gambling addiction therapy. I don’t want psychological counseling. I want insurance if I have a broken bone or cancer. That is illegal to sell in this country.”\n\n“This is going to ruin Republicans if this passes because it’s Obamacare lite,” she added.”Now Republican will get blamed for it. Let it fall. I would rather have nothing than have Republicans take responsibility for something that is just as bad as Obamacare except all your taxes get cut.”\n\nFollow Pam Key on Twitter @pamkeyNEN", "link": "http://www.breitbart.com/video/2017/06/23/ann-coulter-gop-health-care-bill-total-disaster-obamacare-lite/#disqus_thread"}]}, "bbc": {"rss": "http://feeds.bbci.co.uk/news/rss.xml", "link": "http://www.bbc.com/", "articles": [{"title": "Cladding fire tests failed by 34 high-rise blocks", "published": "2017-06-24T20:55:14", "link": "http://www.bbc.co.uk/news/uk-40391395", "text": "Media playback is unsupported on your device Media caption Watch: Camden resident confronts council chief\n\nCladding on 34 tower blocks in 17 council areas in England has failed fire safety tests, the government says.\n\nOfficials provided updated figures as Camden Council became the first authority to evacuate residents over concerns, asking people living in four high-rise buildings to leave.\n\nThe council said it had no option but to move residents of 650 flats on the Chalcots Estate while work takes place.\n\nCommunities Secretary Sajid Javid said they had shown \"calm and stoicism\".\n\nBut he said a test failure does not necessarily mean a building will have to be evacuated.\n\nHe said the decision taken by Camden was because the failed testing of the external cladding was \"compounded by multiple other fire safety failures\" within the buildings.\n\nTesting of potentially combustible cladding \"is running around the clock\" and interim safety measures are being put in place for all affected buildings, Mr Javid added.\n\nEarlier, Camden council's Labour leader, Georgia Gould, said the authority had acted \"as swiftly as we possibly can\" to ensure people's safety.\n\nMs Gould said the fire service \"told us they could not guarantee our residents' safety in those blocks\".\n\n\"I know it's difficult, but Grenfell changes everything and I just don't believe we can take any risk with our residents' safety and I have to put them first.\n\n\"I offered to pay for fire stations to be stationed outside all of those blocks so we could have a couple of days to get the work done but the message was there was absolutely nothing I could do to make those blocks safe that night.\"\n\nShe said that if people still choose to not leave their homes then it would \"become a matter for the fire services\".\n\nMedia playback is unsupported on your device Media caption Air beds laid out in Swiss Cottage leisure centre\n\nPrime Minister Theresa May said \"necessary\" steps will be taken to find people accommodation.\n\nMrs May said: \"We are making sure that the authority has the ability to do what is necessary to ensure people have somewhere to stay and that the work is done so that those tower blocks will become safe for them to return to in future.\"\n\nOther high-rise buildings, such as some used by the NHS, are also being tested.\n\nThe Department for Communities and Local Government have named seven of the 17 local authorities where high-rise buildings have failed fire safety tests as:\n\nCamden - where residents have been evacuated from four blocks on the Chalcots estate\n\nBrent - where a housing association tower block, Elizabeth House, has cladding but London Fire Brigade advises it is not a risk\n\nBarnet - where cladding put up on three towers in 2012 is to be removed\n\nHounslow - where Clements Court tower in Cranford is to have outer cladding removed\n\nManchester - where 78 panels are being removed from one area of the Village 135 development in Wythenshawe\n\nPlymouth - where three blocks on the Mount Wise Tower estate were found to have cladding made from similar material to Grenfell Tower\n\nPortsmouth - where the city council is removing cladding from Horatia House and Leamington House in Somerstown\n\nThe estate's cladding is similar to Grenfell Tower in west London, where a fire is feared to have killed 79.\n\nThe Metropolitan Police say manslaughter, health and safety, and fire safety charges will be considered in relation to that blaze.\n\nChalcots was refurbished between 2006 and 2009 by the same firm, Rydon, that oversaw work at Grenfell Tower in 2015-16.\n\nCamden Council says it will remove external thermal cladding from five tower blocks on the Chalcots estate.\n\nIt also said there were concerns about the insulation of gas pipes going into flats, and fire doors.\n\nThe council initially announced the evacuation of one tower block, Taplow, but later extended the move to all five tower blocks it had checked.\n\nIn the early hours of Saturday morning, the council then announced that one of the five - Blashford - did not need to be evacuated, and residents could return, because it is smaller and has \"several different design elements\".\n\nAt the scene\n\nBy Cherry Wilson, BBC News\n\nChildren jump on the climbing frames and kick around a ball in the playground outside Swiss Cottage leisure centre.\n\nIt would seem like a typical Saturday for families, except many are laden with bags or suitcases after leaving their homes.\n\nLocals say they are weary, after a chaotic night of mixed messages about whether or not they can stay in their homes.\n\nPamela Woodward, 72, and her husband are walking away from the centre with two black suitcases, after being told they will be put up in a hotel.\n\nThey stayed in their tower block last night after being told at 2am that someone would be back to collect them - but no-one returned.\n\nPamela said: \"I think there has been a big cock-up. I feel terrible. I just want to be at home. I've been up all night waiting for them.\"\n\nEmergency accommodation was set up at Swiss Cottage leisure centre and at the Camden Centre in King's Cross.\n\nBut Camden Council, which said it already spent £500,000 on hotel rooms, said it would reimburse residents who have paid for their own temporary accommodation.\n\nMs Gould urged them to stay with family and friends if possible and encouraged remaining residents to vacate their blocks.\n\nThe decision to evacuate the buildings was made at 18:30 BST on Friday.\n\nThe work is expected to take three to four weeks. Residents will be allowed in at the weekend to collect more possessions under escort from the fire brigade.\n\nMedia playback is unsupported on your device Media caption Watch: Meet Rosie, who refused to leave Taplow Tower\n\nBob O'Toole, chairman of Chalcots Estate residents' association, told BBC Breakfast that contractors had been working overnight in several of the tower blocks.\n\n\"A lot of people are annoyed because of the way [the evacuation] was done. They're saying it was left too late in the evening. But Camden Council didn't get the information till late, and they acted on that as quickly as possible.\"\n\nOne resident, Belinda, says she is among a number of tenants who are refusing to leave their flats \"because we think it's unnecessary and some don't know what they will do with their pets.\"\n\nShe said council lawyers accompanied by police have advised her to vacate the building, but added: \"They know they can't force us to leave without legal documents which will take them time to put together.\"\n\nImage copyright AFP Image caption The estate recently underwent a £66m refurbishment\n\nLabour leader Jeremy Corbyn said councils across the country needed to deal \"swiftly and effectively with the scale of the fire safety challenge\" posed by the Grenfell Tower fire and the government's emergency Cobra committee should meet to plan a stronger response.\n\n\"This is now a nationwide threat and the prime minister needs to get a grip,\" he added.\n\nLiberal Democrat President Sal Brinton, a member of the All-Party Parliamentary Fire Safety and Rescue Group, said: \"This is a civil emergency. The government must guarantee funding for local councils to do everything necessary to keep people safe and compensate those who have had their lives disrupted.\"\n\nLocal MP Tulip Siddiq backed Camden Council's decision to evacuate the estate saying it was \"not an ideal situation\" but the safety of residents \"needs to come first\".\n\nWhat happens to pets?\n\nImage copyright PA\n\nCamden is working with the RSPCA and animal welfare officers in the neighbouring borough of Islington to help residents with pets.\n\nTwelve dogs, six cats, two budgies, a cockatiel, a parrot, two hamsters, a guinea pig, three tanks of fish, and a hedgehog have been registered with officials.\n\n\"The borough is working really hard to let people take their pets with them to hotels,\" says Zenon Brown from the RSPCA. \"A lot of people do not want to be separated from their pets, understandably.\"\n\nBut there are temporary holding facilities for animals within Islington, and local animal welfare groups have offered volunteer and fostering support for pets.\n\n\"As much as possible we are trying to keep pets and owners together,\" says Joe Clarke from Islington Council. \"But we are also offering help and support... where that can't be facilitated.\"\n\nCamden Council agreed a contract with Rydon Construction to refurbish the Chalcots estate in May 2006 at a cost of £66m.\n\nThe work took more than three-and-a-half years. Five towers received new cladding and 711 flats were modernised with new wiring, heating, kitchens and bathrooms.\n\nMedia playback is unsupported on your device Media caption Council leader Georgia Gould: \"People are very, very distressed\"\n\nDavid Clixby, who lives in a nine-storey council tower block in Billingham, Cleveland, has contacted the BBC to say residents have been notified that the building has been \"partially clad\" in combustible cladding.\n\n\"We are being allowed to stay in our flats until the work starts on Monday, as the fire services have said they are safe enough for us to stay. The council have put 24-hour security in each block until work starts.\"\n\nFriday night's announcement came as the Metropolitan Police said the Grenfell Tower fire started in a fridge-freezer, and outside cladding and insulation failed safety tests.\n\nA national operation to identify buildings with cladding similar to that used in Grenfell Tower has seen local authorities send samples for independent tests.\n\nThe Department for Communities and Local Government said 14 residential high-rise buildings in nine local authority areas have now been found with cladding that raises safety concerns.\n\nDo you live in one of the 27 tower blocks that have failed fire cladding safety tests? Are you a resident in one of the affected tower blocks on the Chalcots estate? Email us at haveyoursay@bbc.co.uk\n\nYou can send your pictures and video to yourpics@bbc.co.uk\n\nYou can also contact us in the following ways:"}, {"title": "Camden tower evacuations: Rosie's story", "published": "2017-06-24T17:33:01", "link": "http://www.bbc.co.uk/news/uk-40394432", "text": "Video\n\nCladding on 27 tower blocks in England have failed fire safety tests.\n\nCamden Council was the first authority to evacuate residents of one estate late on Friday.\n\nDespite being told the buildings are unsafe, 83 people refused to leave their homes.\n\nRosie Turner was one of them. This is why."}, {"title": "Parliament hit by 'sustained' cyber-attack", "published": "2017-06-24T20:24:43", "link": "http://www.bbc.co.uk/news/uk-40394074", "text": "Image copyright PA\n\nParliament has been hit by a cyber attack, officials at Westminster say.\n\nThe \"sustained\" hack began on Friday night, prompting officials to disable remote access to the emails of MPs, peers and their staff as a safeguard.\n\nThe parliamentary authorities said hackers had mounted a \"determined attack\" on all user accounts \"in an attempt to identify weak passwords\".\n\nGovernment sources say it appeared the attack has been contained but it will \"remain vigilant\".\n\nA parliamentary spokeswoman said they were investigating the attack and liaising with the National Cyber Security Centre.\n\nShe said: \"We have discovered unauthorised attempts to access accounts of parliamentary networks users...\n\n\"Parliament has robust measures in place to protect all of our accounts and systems, and we are taking the necessary steps to protect and secure our network.\n\n\"As a precaution we have temporarily restricted remote access to the network.\"\n\n'Not a surprise'\n\nIT services on the parliamentary estate are working normally and a message sent to MPs urges them to be \"extra vigilant\".\n\nBut a number of MPs have confirmed to the BBC they are not able to access their parliamentary email accounts outside of the Westminster estate.\n\nIt comes just over a month after 48 of England's NHS trusts were hit by a cyber-attack.\n\nInternational Trade Secretary Liam Fox said: \"We have seen reports in the last few days of even Cabinet ministers' passwords being for sale online.\n\n\"We know that our public services are attacked so it is not at all surprising that there should be an attempt to hack into parliamentary emails.\n\n\"And it's a warning to everybody, whether they are in Parliament or elsewhere, that they need to do everything possible to maintain their own cyber security.\"\n\nThe latest attack was publicly revealed by Liberal Democrat peer Lord Rennard on Twitter who had also asked his followers to send any \"urgent messages\" to him by text.\n\nHenry Smith, Tory MP for Crawley, later tweeted: \"Sorry no parliamentary email access today - we're under cyber attack from Kim Jong Un, (Vladimir) Putin or a kid in his mom's basement or something...\"\n\nThe government's National Security Strategy said in 2015 that the threat from cyber-attacks from both organised crime and foreign intelligence agencies was one of the \"most significant risks to UK interests\".\n\nThe National Cyber Security Centre, which is part of intelligence agency GCHQ, started its operations in October last year.\n\nThe National Crime Agency said it was working with the NCSC but the centre was \"leading the operational response\"."}, {"title": "Jo Cox MP honoured with Commons plaque", "published": "2017-06-24T15:25:18", "link": "http://www.bbc.co.uk/news/uk-england-leeds-40391819", "text": "Image copyright UK Parliament/Jessica Taylor Image caption Jo Cox's widower Brendan and two children with the new plaque\n\nA coat of arms to honour murdered MP Jo Cox has been unveiled in Parliament by her two children.\n\nThe memorial plaque featuring a coat of arms designed by Cuillin, six, and Lejla, four, was installed in the Commons chamber.\n\nIt was part of a \"family day\" as MPs and staff were encouraged to bring their children into the chamber.\n\nMrs Cox, 41, was shot and stabbed in Birstall, West Yorkshire, part of her Batley and Spen constituency.\n\nThe crime happened little over a year ago, on 16 June 2016.\n\nThe design of the plaque was inspired by Mrs Cox's maiden speech. It contained the line, \"we are far more united and have far more in common than that which divides us\".\n\nImage copyright UK Parliament/Jessica Taylor Image caption The plaque bears the motto More in Common and has elements to show Jo Cox's love of rivers and mountains, and her support for women\n\nThe four roses represent her family members - two red for the Labour Party and two white for the county of Yorkshire.\n\nImage caption Mrs Cox was killed as she arrived at a constituency surgery in June 2016\n\nMPs killed while in office are remembered by heraldic shields in the Commons.\n\nThey Include Conservative MP Ian Gow, killed by an IRA car bomb in 1990; and Tory shadow Northern Ireland secretary Airey Neave, who died in a car bomb attack in Westminster in 1979."}]}, "infowars": {"link": "https://www.infowars.com/", "articles": [{"published": "2017-06-23T12:04:05-05:00", "title": "Sears Closing Another 20 Stores Amid Ongoing Sales Slide", "text": "You can add another 20 Sears and Kmart stores to retail’s graveyard.\n\nSears Holdings is closing another 20 locations on top of recently announced shutterings, bringing to total store closures to 260 this year for the struggling retailer which is trying unsuccessfully to stanch years of sales declines. The latest closures include 18 Sears stores and two Kmart locations, according to a regulatory filing on Friday by real estate investment trust Seritage Growth Properties, which was spun off by Sears in 2015.\n\nThese stores will start liquidation sales by June 30 and be closed by mid-September, Sears said in a statement.\n\nRead more", "link": "https://www.infowars.com/sears-closing-another-20-stores-amid-ongoing-sales-slide/"}, {"published": "2017-06-23T12:57:41-05:00", "title": "Actor Seth Rogen Mocks Man Who Was Stabbed 9 Times For Supporting Trump", "text": "Actor Seth Rogen mocked a multiple stabbing victim on Twitter because the Trump supporter did not have health insurance in another shocking example of vulgar leftist rhetoric.\n\nTony Foreman was stabbed nine times following a “free speech rally” in Santa Monica, California, last Saturday. The attackers, a Muslim Armenian gang, told Foreman, “You’re getting the shank White Boy,” before lunging at him with knives.\n\nForeman had paraphernalia on his car that identified him as a Trump supporter.\n\nTwo male suspects later identified as Edgar Khodzhasaryan, 30, and Arsen Bekverdyan, 31, were arrested and charged with attempted murder and assault with a deadly weapon.\n\nImmediately after the vicious attack, instead of using it to reflect on the rising tide of anti-Trump hate crime that has swept the nation, the left exploited the stabbing to make fun of the victim for not having health insurance.\n\nThis man has a family. He is critically ill in hospital having been stabbed 9 times. And you mock him? Complete prick.@Sethrogen pic.twitter.com/mHK4rPVsJj — Paul Joseph Watson (@PrisonPlanet) June 23, 2017\n\nActor Seth Rogen followed suit earlier today, tweeting, “Just so everyone knows, I’m NOT a white nationalist, I have NOT been stabbed 9 times, and I DO have health insurance!”\n\nRogen was using the fact that he physically resembled Foreman to mock the victim for not having health insurance. The actor’s tweet was clearly intended to insult the victim because of his political views.\n\nThe reaction was swift.\n\n“He is not alt-right or a white supremacist. He’s a good guy with a big heart looking to fight for his country. What’s wrong with you dude?” asked Mike Tokes.\n\n“I’m a Latino so he’s not a white supremacist. He’s a kind person who doesn’t discriminate. See him at the hospital and apologize,” demanded Congressional candidate Omar Navarro.\n\n“In an age where everyone gets accused of being “racist”, making fun of someone that’s been stabbed 9 times seems… humorless,” added another Twitter user.\n\nRogen’s tweet is a disgrace, but it’s par for the course in an age where leftists engage in the most vitriolic hate against conservatives with wanton abandon.\n\nDoes Rogen ever wonder why vile, out of touch, elitist Hollywood pricks like himself are so reviled by flyover country?\n\nThis tweet is why. This tweet is why Trump won.\n\nSUBSCRIBE on YouTube:\n\nFollow on Twitter: Follow @PrisonPlanet\n\nFacebook: https://www.facebook.com/paul.j.watson.71\n\n*********************\n\nPaul Joseph Watson is the editor at large of Infowars.com and Prison Planet.com.", "link": "https://www.infowars.com/actor-seth-rogen-mocks-man-who-was-stabbed-9-times-for-supporting-trump/"}, {"published": "2017-06-22T15:46:39-05:00", "title": "Civil Emergency: Sinister Forces Align In The Deep State To Turn Soft Coup Hot", "text": "The deep state are becoming desperate as Donald Trump continues to destroy the globalist’s plans.", "link": "http://www.infowars.com/civil-emergency-sinister-forces-align-in-the-deep-state-to-turn-soft-coup-hot/"}, {"published": "2017-06-23T18:26:13-05:00", "title": "House Bill to Restrict Pentagon Contracts With Chinese Telecoms", "text": "The pending House defense bill contains new provisions that would restrict the Pentagon from buying equipment from Chinese or Russian telecommunications firms over cyber attack fears.\n\nA section of the fiscal 2018 defense authorization legislation calls for protecting the security of the nuclear command and control and communications systems from the threat of hacking and cyber attacks from Beijing or Moscow.\n\nIf passed into law later this year, the bill specifies the secretary of defense must certify whether the Pentagon is using telecommunications equipment provided by Chinese-military linked companies, Huawei Technologies or the ZTE Corp., or Russian firms.\n\nThe bill then states the defense secretary may not approve any contracts for equipment or services from the two firms, as well as any equipment produced in Russia.\n\nRead more", "link": "http://www.infowars.com/house-bill-to-restrict-pentagon-contracts-with-chinese-telecoms/"}]}, "washingtonpost": {"rss": "http://feeds.washingtonpost.com/rss/world", "link": "https://www.washingtonpost.com/", "articles": []}, "cnn": {"link": "http://edition.cnn.com/", "articles": [{"published": "2017-06-22T00:00:00", "title": "Laura Kraut: Why Cedric is the horse of a lifetime", "text": "Story highlights Laura Kraut names Cedric her horse of a lifetime\n\n(CNN) Laura Kraut has been riding horses since the age of three.\n\nThe American boasts an impressive CV, which includes team jumping gold at the 2008 Olympic Games in Beijing and a third-place finish in the 2013 Longines Global Champions Tour.\n\nNow 51, Kraut has a wealth of experience and there are few riders better placed to talk about horses than her.\n\nShe has undoubtedly ridden many a prized steed in her career, but which would be her horse of a lifetime if she had to choose one?\n\nJUST WATCHED LGCT and GCL special: Cannes mid-season wrap Replay More Videos ... MUST WATCH LGCT and GCL special: Cannes mid-season wrap 22:54\n\n\"Well, it was pretty easy to choose,\" the Rome Gladiators rider tells CNN Equestrian. \"I would say it's Cedric, the horse I rode at the Olympics in Beijing.\n\nRead More", "link": "http://edition.cnn.com/2017/06/22/sport/cedric-horse-of-a-lifetime-laura-kraut-lgct/index.html"}, {"published": "2017-06-07T00:00:00", "title": "A volcano on an island within a lake within an island", "text": "Ronan O'Connell, CNN • Updated 13th June 2017\n\nEditor's Note — CNN Travel's series often carries sponsorship originating from the countries and regions we profile. However, CNN retains full editorial control over all of its reports. Read the policy.\n\n( CNN ) — It's considered one of the world's most dangerous active volcanoes.\n\nJust 55 kilometers south of Manila, Taal Volcano has erupted 30 times since the 16th century, accounting for the deaths of more than 5,000 people.\n\nYet it's scaled daily by dozens of groups of laid-back tourists.\n\nPerhaps they're calmed by Taal's reputation as the smallest active volcano in the world -- it's just 311 meters tall -- a title that hints at peril yet makes Taal sound relatively unintimidating.\n\nOr maybe it's the fact that after eight eruptions in the 1960s and 1970s, Taal Volcano has not vented its fury since 1977.\n\nIt's also in an incredible location that defies belief.\n\nTaal Volcano sits on an island within a lake within an island, adjacent to the holiday town of Tagaytay, a popular getaway for Manila residents.\n\nReady to take the risk?\n\nAfter arriving in Tagaytay, the first step is to take an outrigger boat across the deep blue waters of Taal Lake to Volcano Island.\n\nThis 15-minute trip costs about $10 each way -- you can hire a boat yourself or join a group tour from Tagaytay. Once visitors arrive at the main jetty on Volcano Island they can choose whether to do a 30 to 40-minute hike up its slope or complete the ascent on horseback.\n\nA small tourism office next to the jetty offers a horse and guide for about $20 return, although there's wiggle room if you're a skilled barterer. Considering the high heat and humidity in Tagaytay throughout the whole year, riding a horse is an attractive option.\n\nI picked the biggest one I could find, mounted it and headed off from the office with my young Filipino guide Anna leading the way.\n\nDespite the rough, bumpy dirt path, which leads up to the volcano rim, it was an enchanting experience.\n\n\n\n\n\n\n\n\n\n\n\n\n\n1 / 7 Taal Volcano: Located about 30 minutes south of Manila, Taal Volcano sits within a lake within an island, adjacent to the holiday town of Tagaytay, a popular getaway for Manila residents. The smallest volcano in the world, at just 1,020 feet tall Taal attracts thousands of tourists every year.\n\nFor me it was, at least. My horse clearly didn't share my enjoyment, becoming increasingly skittish.\n\nAs other tourists overtook me on their relaxed steeds, my horse stopped to make prolonged noises of apparent anguish.\n\n\"I'm sorry but I think you're too big,\" Anna told me sheepishly.\n\nAt 197 centimeters tall and 126 kilograms in weight, I could only nod in agreement. After covering minimal ground during my five-minute horse ride, I set off on foot. Roughly half of the other tourists heading for the rim were also hiking.\n\nThe slope is relatively gentle, making it a fairly easy hike for people even with a low level of fitness.\n\nThere are also ready-made excuses to take a rest if you do lose your breath. The higher you climb, the more striking the views across the island and the crystalline waters of Taal Lake.\n\nHiking boots or running shoes are advised -- the dirt path is frequently uneven and unstable. There's also great value in hiring a guide to ascend with you, even if you're not riding a horse.\n\nAnna was fine company and provided much info about Taal Volcano's lethal history -- including the fact it once erupted for more than six months, back in 1754.\n\nA volcanic Russian doll\n\nAs I completed the final ascent to the rim I detected a pungent, chemical odor. It's hard not to feel alarmed when experts warn that acrid fumes or strong sulfuric scents are a pre-cursor to an eruption. Then at the rim I found a couple sitting on a bench eating ice cream, while a young family giggled as they hit golf balls into the crater.\n\nClearly, there was no cause for concern.\n\nThe volcano is only closed to visitors on the rare occasion that Filipino authorities upgrade it from an \"Alert Level 0\" to an \"Alert Level 1,\" which means there's no threat of imminent eruption but that the volcano is behaving abnormally.\n\nThese tourists were soaking in what, for many visitors, is the payoff of scaling the volcano -- sprawling views of the crater, its lake and beyond.\n\nIn the fading afternoon light, the waters of Crater Lake appeared to gently bubble in certain areas, while other patches were stained white by sulfur.\n\nAdventurous visitors can hike around the rim. There are two trails, both about a kilometer long, which head in opposite directions around the rim.\n\nLike the path up the mountain they're rugged so progress is slow. These paths are also narrow, with steep drops on one side, so caution is necessary. The steam, rising from the earth near sections of these paths, provides a reminder of the volcano's deadly power.\n\nWhat these trails also offer is a closer vantage of the small, volcanic Vulcan Point Island inside Crater Lake.\n\nTaal is like a volcano version of a Russian doll.\n\nTiny Vulcan Point Island sits inside Crater Lake, which sits inside the Taal Volcano, which is inside Taal Lake. All are contained within Taal Caldera, a massive volcanic crater created hundreds of thousands of years ago by a gigantic eruption.\n\nThis prehistoric tectonic activity spawned a chain of volcanoes on the western side of Luzon Island, the largest of the more than 7,000 islands in the Philippines.\n\nTaal Volcano may be the deadliest of them all. But it's been asleep for 40 years. So now is a good time to visit.\n\nGetting there\n\nBuses and minivans depart downtown Manila for Tagaytay at regular intervals each day. The trip takes between 90 minutes and two hours.", "link": "http://www.cnn.com/2017/06/07/travel/tagaytay-taal-volcano-philippines/index.html"}, {"published": "2017-06-23T00:00:00", "title": "Turkey: Violent homophobia festers in Erdogan's shadow", "text": "Editor's note: This story contains homophobic language some readers might find offensive. The non-binary pronouns \"they\" and \"them\" have been used in the singular form to refer to individuals who do not identify as a specific gender. \"LGBTI+\" refers collectively to people who identify as lesbian, gay, bisexual, trans, intersex or another sexual minority.\n\nAnkara, Turkey (CNN) -- It was a warm summer night in July 2015 and Kemal Ordek, a sex worker at the time, was waiting at home for the next client to arrive.\n\nTwo men, posing as customers, entered Ordek's apartment in Ankara. They beat Ordek -- whose gender is non-binary-- stole their phone and one raped them. At one point a third man, a relative of the other two, entered the apartment and demanded money.\n\nThe men dragged Ordek, 32, out into the street and towards a nearby cash machine. There, Ordek spotted a police car and ran to tell the officers what had happened. The attackers followed, telling the police they were \"family men\" who had been lured into Ordek's home. They denied doing anything wrong.\n\nOrdek's version of events was dismissed by police on the spot, Ordek says. The officers threw Ordek and the men into their patrol car and drove to the police station. \"Don't even dare make a criminal complaint. I'll chop off your head, we'll kill you,\" one attacker said, according to Ordek.\n\nKemal Ordek, author, activist and director of the Red Umbrella Organization Sexual Health and Human Rights at the organization's headquarters in Ankara in April.\n\nLater that night, police released Ordek's attackers without explanation. Ankara police declined to comment by phone or text message, asking that CNN send its request by handwritten letter.\n\nAccording to Ordek's attorney, it was only after they filed a civil complaint, and sought legal representation that police launched a criminal investigation.\n\nFor the next year, Ordek says the attackers unleashed a campaign of intimidation against them. Ordek also claims that pressure was applied by police to drop the complaint.\n\nPolice arrested the attackers last November. They were ultimately convicted for their crimes and sentenced to seven and a half years each for looting. One of the attackers had faced 20 years in prison for aggravated sexual assault but his lawyer was able to get that charge dropped upon appeal.\n\nWhile the case gained support from human rights organizations and attention from the national media, Ordek's family disowned them.\n\n\"My father told me, 'you better get killed instead of being raped because this is against our honor,'\" Ordek said.\n\nPosters in support of transgender sex workers' rights cover the walls of the Red Umbrella Sexual health and Human Rights Association in Ankara.\n\nAlthough homosexuality has been legal in Turkey since 1923, Turkey has one of the worst records of human rights violations against LGBTI+ people in Europe, according to a 2016 report from the European Region of the International LGBTI Association. A separate 2016 report to the United Nations by Turkish LGBTI+ advocacy groups identified at least 41 hate crimes against lesbian, gay, bisexual, or transgender people that resulted in death from 2010 to June 2014.\n\nOrdek survived the brutal attack, but many others haven't.\n\nIn 2009, Eda Yildirim, a transgender sex worker was decapitated and burned alive; her breast implants cut out of her before she was murdered. In 2015, another transgender sex worker died after being stabbed 200 times by a client. In 2016, a young transgender woman named Hande Kader, a prominent member of the LGBTI+ community, was raped and burned alive. Her killer has not been found. Even when identified, many of the murder suspects have not been prosecuted.\n\nMustafa Yeneroglu, the Chief of Turkey's Parliament's Human Rights Observation Commission, told CNN that he had personally researched some of these incidents, but described them as \"mostly individual cases\" that didn't point to abuse of the LGBTI+ community.\n\nHighlighting that the victims were sex workers, Yeneroglu said: \"It should be researched sociologically and psychologically why these people are found in a criminal situation ... like (roadside) prostitution.\"\n\nHomosexuality is a biological disorder, a disease ... something that needs to be treated. Selma Aliye Kavaf, former state minister for family affairs\n\nBut Ordek -- the director of the Red Umbrella Sexual Health and Human Rights Association, an NGO promoting health and rights for sex workers in Turkey -- says that according to their research, roughly 90% of the country's transgender people feel sex work is the only way they can make a living.\n\nBetul, a transgender woman who asked CNN to refer to her only by her first name for her safety, spent nearly ten years of her life trying to work a \"regular job\" after graduating from university but was repeatedly sexually assaulted.\n\nEventually Betul turned to sex work, but faced more violence than before. Last year, an organized crime gang attacked Betul in her home, nearly severing her hand from her wrist.\n\nAfter recovering from the attack, Betul pressed charges against her assailants, but the prosecutor assigned to her case was arrested shortly after, over his alleged ties to Fethullah Gulen, the Muslim cleric in self-imposed exile who President Recep Tayyip Erdogan has accused of being behind a failed military coup to overthrow him in 2016.\n\nErdogan's rise\n\nLGBTI+ activists fear that the fight for justice will become even more difficult following Erdogan's referendum win in April which gives him sweeping new powers over the judiciary.\n\nBefore Erdogan became Prime Minister in 2003, he garnered support by giving a voice to minority groups, including the LGBTI+ community, declaring in 2002, \"homosexuals must also be given legal protection for their rights and freedoms.\" But two years later, Erdogan's ruling Justice and Development Party (AKP) removed the phrase \"sexual orientation\" from a draft law, describing it as \"unnecessary.\"\n\nJUST WATCHED Erdogan: What you need to know Replay More Videos ... MUST WATCH Erdogan: What you need to know 01:42\n\nAs Erdogan tightened his grip on power in the intervening years, activists say he and his government became more conservative, more Islamist and more homophobic.\n\nIn 2010, then former state minister for family affairs, Selma Aliye Kavaf told Turkish newspaper Hurriyet, \"homosexuality is a biological disorder, a disease ... something that needs to be treated.\"\n\nIn 2013, Erdogan described homosexuality as a \"sexual preference\" that was incompatible with the \"culture of Islam\" in Turkey.\n\n'We're just passing days here'\n\nOn a quiet lane in central Ankara, Ordek sat with peers who had gathered to discuss their future in post-referendum Turkey.\n\nA lawyer, who asked for her identity to be concealed for her security, told CNN that Erdogan used the referendum campaign to usher in a new wave of homophobic hate speech, and said the President is fostering a culture of police hostility whipped up by his extreme rhetoric. Erdogan's press office did not respond to CNN's repeated requests for comment.\n\nHostility to the LGBTI+ community has also seeped into Turkey's pro-government news organizations. In the wake of the terror attack in Orlando in 2016, when 49 people were gunned down at a nightclub, popular among gay men, the headline in the far-right Yeni Akit paper read: \"50 perverts killed in bar.\"\n\nAnd in March, just one month before the referendum vote, Interior Minister Suleyman Soylu told the former editor of Hurriyet \"to go and hang with faggots in the US.\"\n\nAccording to a 2013 Pew Research Center Survey, 78% of Turkish people said they reject homosexuality. Today, the LGBTI+ community feels the government is unable or unwilling to prevent violence against them. Some say they fear that they will even be targeted by their own families. This has prompted an increasing number of people in the community to seek help, the lawyer said.\n\n\"If a family member decides to...kill you, they can because the government doesn't effectively investigate,\" she said. \"They turn their backs to these 'honor killings.'\"\n\nYeneroglu, the head of the Parliament's human rights commission, told CNN that the commission will be meeting with LGBTI+ organizations to follow up on their concerns, but he did not specify when.\n\nSerkan, 28. \"The government's perspective on gender studies has changed.\"\n\nSerkan, a gay 28-year-old PhD student from Istanbul who asked CNN not to publish his last name out of concerns for his safety, said his university has also become more intolerant as Erdogan has tightened his grip on power.\n\nSerkan and his university's gender studies department is \"almost non-existent.\" He says most of the academics in the department were fired following Turkey's post-coup crackdown, which has seen more than 110,000 people detained and almost 50,000 of them arrested.\n\n\"Since the purge started, the government's perspective on social science departments, specifically in gender studies, has changed,\" he told CNN. \"It was a hostile change.\"\n\nThis atmosphere of fear permeates all levels of society, according to Tolga, a 21-year-old office worker who came out as gay only four years ago. He asked for his last name to be withheld out of concerns for his safety.\n\nTolga, 21. \"I feel safe in the office, but not in general. We're just passing days here.\"\n\nAs he lists a number of political upheavals -- from the 2016 failed coup to a bloody fight against the resurgence of a Kurdish separatist movement in the south -- Tolga fears that the LGBTI+ community is increasingly becoming a scapegoat as President Erdogan seeks to consolidate power and eliminate all dissenting voices.\n\n\"When I go to sleep at night, I'm always worried about what will happen the next day,\" he said.\n\n\"Especially under the state of emergency [which was imposed in July 2016], everyone is feeling particularly concerned in their daily lives. I have started coming to work from a street that is safer than my usual route,\" Tolga told CNN.\n\nTolga fears that his way of life is being forced underground as Turkey's gay people lose public spaces where they can safely congregate. He cites the terrorist attack on a prestigious gay-friendly nightclub in Istanbul on New Year's Eve, and the state-ban on Ankara and Istanbul gay pride events last year.\n\n\"I fear I'm going to have to live a life where I meet with my friends in houses and in private -- I fear that socializing outside will stop,\" he said.\n\nHe also worries that Erdogan is pitting what many LGBTI+ people see his increasingly Islamist conservatism against the country's traditionally secular, urban society. \"The political situation changes in the country very rapidly, so I don't know what it's going to be like the next day,\" he said.\n\n\"I fear for civil war in this country.\"", "link": "http://www.cnn.com/2017/06/23/europe/turkey-homophobia-violence/index.html"}, {"published": "2017-05-31T00:00:00", "title": "Cape Town drought is worst in over a century", "text": "Story highlights Cape Town is in its worst drought in 100 years and the situation is likely to be a long-term problem\n\nCity residents have been asked to reduce water usage to 100 liters per day\n\n(CNN) The worst drought in a century is forcing the most stringent water restrictions ever implemented for South Africa's second largest city.\n\nCape Town has less than 10% of its useable water remaining for its nearly 4 million residents.\n\nThe city is implementing Level 4 water restrictions , which ask residents to limit daily usage to 100 liters (26 gallons) per person. The measure is meant to reduce demand and conserve what little water is still available, and means significant sacrifices for residents.\n\nFor Cape Town resident Suzanne Buckley, the restrictions mean adapting to a new lifestyle.\n\n\"We have buckets in our shower and bathroom sink to save excess water,\" Buckley said. \"The gray water is then used to flush our toilets.\"\n\nPhotos: Cape Town faces severe drought Dry sand bakes in the sun on April 16, 2017, at the Theewaterskloof Dam, a key source of water to Cape Town, South Africa. Hide Caption 1 of 7 Photos: Cape Town faces severe drought The Theewaterskloof Dam on May 10 held less than 20% of its water capacity. Hide Caption 2 of 7 Photos: Cape Town faces severe drought A boat lay on the sand on May 10 at the Theewaterskloof Dam. Hide Caption 3 of 7 Photos: Cape Town faces severe drought A truck crosses a bridge on May 10 at Theewaterskloof Dam. Bridge supports show previous high water marks. Hide Caption 4 of 7 Photos: Cape Town faces severe drought Bare sand and dried tree trunks stand on May 10 at the Theewaterskloof Dam. Hide Caption 5 of 7 Photos: Cape Town faces severe drought The Theewaterskloof Dam on May 8 experienced an extremely low water level. Hide Caption 6 of 7 Photos: Cape Town faces severe drought Sand and dry trees stand on April 16 at the Theewaterskloof Dam, where the water level has been extremely low. Hide Caption 7 of 7", "link": "http://www.cnn.com/2017/05/31/africa/cape-town-drought/index.html"}]}, "nbcnews": {"link": "http://www.nbcnews.com/", "articles": []}}}